<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of MSOnedrive and builds a package.</string>
	<key>Identifier</key>
	<string>com.github.cfellner.recipes.MSOneDrive.pkg.MSOneDrive</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MSOneDrive</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.apettinen.download.MSOneDrive</string>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>Process</key>
	<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkgdirs</key>
					<dict>
						<key>Applications</key>
						<string>0755</string>
					</dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				</dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>Copier</string>
				<key>Arguments</key>
				<dict>
					<key>source_path</key>
					<string>%pathname%/%SU_FOLDER%</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/%SU_FOLDER%</string>
				</dict>
			</dict>

		<dict>
			<key>Comment</key>
			<string>Get version from the app</string>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/%Identifier%/downloads/MSOneDrive.pkg/Content/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
		</dict>
		<dict>
					<key>Processor</key>
					<string>Versioner</string>
					<key>Arguments</key>
					<dict>
						<key>input_plist_path</key>
						<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/%SU_FOLDER%/SketchUp.app/Contents/Info.plist</string>
						<key>plist_version_key</key>
						<string>CFBundleVersion</string>
					</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/pkgroot/Applications</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>